<!-- dflook/terraform-github-actions {"workspace":"test-destroy-lock-info","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"83e11f13154e57abce4cccbbcff0d929dc94ac0060913599f1112f7426716bfe","plan_job_ref":"Job Test plan target and replace #316 at https://github.com/dflook/terraform-github-actions/actions/runs/4031732531","plan_hash":"a32fa753e7d3a569940e15606dda7b4417d2a69dac452d1e39f84aeaea137184","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __test-destroy-lock-info__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "k3cpfyiEjm" -> (known after apply)
  ~ foreach = "RBY5oWVqev" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #316](https://github.com/dflook/terraform-github-actions/actions/runs/4031732531)